#language: ru

@tree
@Отчеты

Функционал: Тестирование отчета Остатки товаров

Как тестировщик я хочу
протестировать отчет Остатки товаров
чтобы проверить доступность фильтров и формирование отчета

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка отчета Остатки товаров
* Открытие отчета
	И я закрываю все окна клиентского приложения
	И В командном интерфейсе я выбираю "Закупки" "Остатки товаров"
	И я нажимаю на кнопку "Выбрать вариант..."
	И в таблице 'СписокНастроек' я перехожу к строке:
		| "Представление" |
		| "Основной"      |
	И в таблице 'СписокНастроек' я выбираю текущую строку
* Проверка фильтров
	Тогда открылось окно "Остатки товаров"
	И я нажимаю на кнопку с именем 'ФормаСтандартныеНастройки'
	И я нажимаю на кнопку с именем 'ФормаНастройкиОтчета'
	Тогда открылось окно "Настройки отчета \"Остатки товаров\""
	И в поле с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение' я ввожу текст "31.12.2025"
	И я нажимаю кнопку выбора у поля с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент1Значение'
	Тогда открылось окно "Товары"
	И я нажимаю на кнопку с именем 'ФормаСписок'		
	И в таблице 'Список' я перехожу к строке:
		| "Код"       | "Наименование" |
		| "000000032" | "Торт "        |
	И я нажимаю на кнопку с именем 'ФормаВыбрать'
	Тогда открылось окно "Настройки отчета \"Остатки товаров\""
	И из выпадающего списка с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент2Значение' я выбираю точное значение "Большой"
	И я нажимаю на кнопку с именем 'ФормаЗакончитьРедактирование'
* Формирование отчета с фильтрами
	И я нажимаю на кнопку "Сформировать"
	И я жду когда в табличном документе "Результат" заполнится ячейка "R7C2" в течение 20 секунд
* Проверка соответствия шаблону 1
	Дано Табличный документ "Результат" равен макету "МакетОстаткиФильтры" по шаблону
* Формирование отчета без фильтров
	И я нажимаю на кнопку с именем 'ФормаСтандартныеНастройки'
	И я нажимаю на кнопку с именем 'ФормаНастройкиОтчета'
	Тогда открылось окно "Настройки отчета \"Остатки товаров\""
	И в поле с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение' я ввожу текст "31.12.2025"
	И я нажимаю на кнопку с именем 'ФормаЗакончитьРедактирование'
	И я нажимаю на кнопку "Сформировать"
	И я жду когда в табличном документе "Результат" заполнится ячейка "R7C2" в течение 20 секунд
* Проверка соответствия шаблону 1
	Дано Табличный документ "Результат" равен макету "МакетОстаткиБезФильтров" по шаблону
	И я закрываю все окна клиентского приложения
