#language: ru

@tree

Функционал: Проверка добавления картинок Справочник Товары

Как Тестировщик я хочу
прикрепить картинку в элемент справочника Товары
чтобы проверить новый функционал

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка добавление картинок
*Создание товара
	И В командном интерфейсе я выбираю "Товарные запасы" "Товары"
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	И в поле с именем 'Наименование' я ввожу текст "ТоварТест"
	И я нажимаю на кнопку "Записать"
	И Пауза 10
	
*Добавление картинки
	И я нажимаю кнопку выбора у поля с именем 'ФайлКартинки'
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	И в поле с именем 'Наименование' я ввожу текст "ТестКартинка"
	И я выбираю файл 'C:\Users\Аделина\Documents\GitHub\TestQA\features\Итоговое задание\тест.jpg'
	И я нажимаю на кнопку "Выбрать файл с диска и записать"
	И я нажимаю на кнопку "Записать и закрыть"
	И я жду закрытия окна "Картинка (Файл)" в течение 10 секунд
	И в таблице 'Список' я выбираю текущую строку
	И я нажимаю на кнопку "Записать"
*Проверка наличия добавленой картинки
	И В текущем окне я нажимаю кнопку командного интерфейса "Файлы"
	И таблица 'Список' стала равной:
		| 'Наименование' |
		| 'ТестКартинка' |
*Сохранение Товара
	И В текущем окне я нажимаю кнопку командного интерфейса "Основное"
	И я нажимаю на кнопку "Записать и закрыть"
	И я жду закрытия окна "ТоварТест (Товар)" в течение 10 секунд

	